## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_metric_filter.superset_docs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_docs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/cds-superset-docs"
      + name           = "error-superset-docs"
      + pattern        = "ERROR? Error? error?"

      + metric_transformation {
          + default_value = "0"
          + name          = "error-superset-docs"
          + namespace     = "superset-docs"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` errors logged over 1 minute."
      + alarm_name                            = "errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "error-superset-docs"
      + namespace                             = "superset-docs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` invocation errors logged over 1 minute."
      + alarm_name                            = "invokcation-errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "superset_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/cds-superset-docs",
        ]
      + name                = "Superset Docs - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)error/
            | sort @timestamp desc
            | limit 100
        EOT
    }

Plan: 4 to add, 0 to change, 0 to destroy.
13:35:21.081 WARN   The `TERRAGRUNT_FORWARD_TF_STDOUT` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_FORWARD_STDOUT=true` instead.

Error: reading SNS Topic (cloudwatch-alert-warning): empty result

  with data.aws_sns_topic.cloudwatch_alert_warning_us_east_1,
  on alarms.tf line 12, in data "aws_sns_topic" "cloudwatch_alert_warning_us_east_1":
  12: data "aws_sns_topic" "cloudwatch_alert_warning_us_east_1" {


Error: reading SNS Topic (cloudwatch-alert-ok): empty result

  with data.aws_sns_topic.cloudwatch_alert_ok_us_east_1,
  on alarms.tf line 17, in data "aws_sns_topic" "cloudwatch_alert_ok_us_east_1":
  17: data "aws_sns_topic" "cloudwatch_alert_ok_us_east_1" {

13:35:26.529 ERROR  terraform invocation failed in ./.terragrunt-cache/vYz0pCNtN5QyIIXrq2MuXS1cvuU/2ZNbGkONpJFQb5qY_-8XvT292os/aws
13:35:26.529 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/vYz0pCNtN5QyIIXrq2MuXS1cvuU/2ZNbGkONpJFQb5qY_-8XvT292os/aws
  
  Error: reading SNS Topic (cloudwatch-alert-warning): empty result
  
    with data.aws_sns_topic.cloudwatch_alert_warning_us_east_1,
    on alarms.tf line 12, in data "aws_sns_topic" "cloudwatch_alert_warning_us_east_1":
    12: data "aws_sns_topic" "cloudwatch_alert_warning_us_east_1" {
  
  
  Error: reading SNS Topic (cloudwatch-alert-ok): empty result
  
    with data.aws_sns_topic.cloudwatch_alert_ok_us_east_1,
    on alarms.tf line 17, in data "aws_sns_topic" "cloudwatch_alert_ok_us_east_1":
    17: data "aws_sns_topic" "cloudwatch_alert_ok_us_east_1" {
  
  
  exit status 1


```

</details>

